Autodesk.Revit.DB.IFCExportElementType
An enumerated type defining if an element type is exported to IFC or not.

Autodesk.Revit.DB.IFCExportElementType.No
Don't export element type to IFC regardless of category or Revit element settings.

Autodesk.Revit.DB.IFCExportElementType.Yes
Export element type to IFC regardless of category or Revit element settings.

Autodesk.Revit.DB.IFCExportElementType.Default
Export element type to IFC according to category or Revit element settings.